/*
Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.
Решение:
*/

void ShowNumbers(int n)
{
    if (n > 1) ShowNumbers(n - 1);
    Console.Write(n + " ");
}
ShowNumbers(5);

/*
Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.
Решение:
*/

/*
Задайте значения M и N.
Напишите программу, которая выведет все натуральные числа в промежутке от M до N.

Решение:
*/




/*
Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

Решение:
*/

